# Вибір одиниць вимірювань для ваги
weight_unit = input("Виберіть одиниці вимірювань для ваги (kg або lb): ")
if weight_unit not in ['kg', 'lb']:
    print("Невірні одиниці вимірювань для ваги. Використайте 'kg' або 'lb'.")
    exit()

# Вибір одиниць вимірювань для зросту
height_unit = input("Виберіть одиниці вимірювань для зросту (m або in): ")
if height_unit not in ['m', 'in']:
    print("Невірні одиниці вимірювань для зросту. Використайте 'm' або 'in'.")
    exit()

# Зчитуємо введені користувачем дані
weight = float(input(f"Введіть вагу у {weight_unit}: "))
height = float(input(f"Введіть зріст у {height_unit}: "))

# Розрахунок індексу маси тіла (ІМТ)
if weight_unit == 'lb':
    # Конвертація фунтів в кілограми
    weight = weight * 0.453592

if height_unit == 'in':
    # Конвертація дюймів в метри
    height = height * 0.0254

# Розрахунок ІМТ для метричної системи
bmi = weight / (height ** 2)

# Виводимо результат
print(f"Ваш індекс маси тіла: {bmi}")